/**
 * Суммирует две матрицы
 * 
 *```js
 * matrixMulNum([
   *    [1, 2, 3],
   *    [4, 5, 6],
   *    [7, 8, 9],
   * ], [
   *  [9, 8, 7],
   *  [6, 5, 4],
   *  [3, 2, 1],
   * ]); 
   * // [10, 10, 10],
   * // [10, 10, 10],
   * // [10, 10, 10],
   * ```
   * 
   * @param a первая матрица (в виде двумерного массива)
   * @param b вторая матрица (в виде двумерного массива)
   * @returns сумма двух матриц
  */
  export default function matrixPlusMatrix(matrix: number[][], num: number): number[][] {
     return [];
  }